Rafa350/EOS/v2/Source/HTL/STM32/htlUART.cpp
#include "HTL/htl.h"
#include "HTL/STM32/htlClock.h"
#include "HTL/STM32/htlUART.h"


using namespace eos;
using namespace htl;
using namespace htl::uart;
using namespace htl::clock;


static void setParity(USART_TypeDef *usart, Parity parity);
static void setWordBits(USART_TypeDef *usart, WordBits wordBits, bool useParity);
static void setStopBits(USART_TypeDef *usart, StopBits stopBits);
static void setHandsake(USART_TypeDef *usart, Handsake handsake);
static void setReceiveTimeout(USART_TypeDef *usart, unsigned timeout);

static ClockSource getClockSource(USART_TypeDef *usart);
static unsigned getClockFrequency(USART_TypeDef *usart, ClockSource clockSource);

static void enable(USART_TypeDef *usart);
static void disable(USART_TypeDef *usart);

static void enableTransmission(USART_TypeDef *usart);
static void enableTransmissionIRQ(USART_TypeDef *usart);
static void enableTransmissionDMA(USART_TypeDef *usart);
static void disableTransmission(USART_TypeDef *usart);

static void enableReception(USART_TypeDef *usart);
static void enableReceptionIRQ(USART_TypeDef *usart);
static void enableReceptionDMA(USART_TypeDef *usart);
static void disableReception(USART_TypeDef *usart);

static bool waitTransmissionCompleteFlag(USART_TypeDef *usart, unsigned expireTime);
static bool waitTransmissionBufferEmptyFlag(USART_TypeDef *usart, unsigned expireTime);
static bool waitReceptionBufferNotEmptyFlag(USART_TypeDef *usart, unsigned expireTime);


/// ----------------------------------------------------------------------
/// \brief    Constructor.
/// \param    usart: Registres hardware del modul USART.
///
UARTDevice::UARTDevice(
	USART_TypeDef *usart):

	_usart {usart},
	_state {State::invalid},
	_dmaNotifyEvent {*this, &UARTDevice::dmaNotifyEventHandler} {

	_state = State::reset;
}


/// ----------------------------------------------------------------------
/// \brief    Inicialitza el modul UART.
/// \return   El resultat de l'operacio.
///
eos::Result UARTDevice::initialize() {

	if (_state == State::reset) {

		activate();
		disable(_usart);

		_usart->CR2 &= ~(
			USART_CR2_RTOEN |  // RTO deshabilitat
			#if defined(EOS_PLATFORM_STM32G0)
	    	USART_CR2_LINEN |  // Modus sincron, deshabilita LIN
			#endif
			USART_CR2_CLKEN);  // Modus sincron, desabilita CLK

		_usart->CR3 &= ~(
			#if defined(EOS_PLATFORM_STM32G0)
			USART_CR3_SCEN |   // Desabilita smartcad
			USART_CR3_IREN |   // Desabilita IRDA
			#endif
			USART_CR3_HDSEL);  // Desabilita half-duplex

		enable(_usart);

		_state = State::ready;

		return eos::Results::success;
	}

	else
		return eos::Results::errorState;
}


/// ----------------------------------------------------------------------
/// \brief    Desinicialitza el modul.
/// \return   El resultat de l'operacio.
///
eos::Result UARTDevice::deinitialize() {

	if (_state == State::ready) {

		disable(_usart);
		deactivate();

		_state = State::reset;

		return eos::Results::success;
	}

	else
		return eos::Results::errorState;
}


/// ----------------------------------------------------------------------
/// \brief    Selecciona el protocol de comunicacio.
/// \param    wordBits: Les opcions de paraula.
/// \param    parity: Les opcions de paritat.
/// \param    stopBits: Les opcions de parada.
/// \param    handsake: Protocol.
/// \return   El resultat de l'operacio.
///
eos::Result UARTDevice::setProtocol(
	WordBits wordBits,
	Parity parity,
	StopBits stopBits,
	Handsake handsake) {

	if (_state == State::ready) {
		setParity(_usart, parity);
		setWordBits(_usart, wordBits, parity != Parity::none);
		setStopBits(_usart, stopBits);
		setHandsake(_usart, handsake);
		return Results::success;
	}
	else
		return Results::errorState;
}


/// ----------------------------------------------------------------------
/// \brief    Asigna el valor del timeout per recepcio.
/// \param    timeout: El temps.
/// \param    El resultat de l'operacio.
///
eos::Result UARTDevice::setRxTimeout(
    unsigned timeout) {

	if (_state == State::ready) {
		setReceiveTimeout(_usart, timeout);
		return Results::success;
	}
	else
		return Results::errorState;
}



/// ----------------------------------------------------------------------
/// \brief    Asigna els valor de temporitzacio.
/// \param    baudMode: Les opcions del baud rate
/// \param    clockSource: Les opcions de clocking.
/// \param    rate: El valor de velocitat.
/// \param    overSampling: Tipus de mostreig
/// \return   El resultat de l'operacio.
///
eos::Result UARTDevice::setTimming(
	BaudMode baudMode,
	ClockSource clockSource,
	uint32_t rate,
	OverSampling overSampling) {

	if (_state == State::ready) {

		switch (baudMode) {
			case BaudMode::b1200:
				rate = 1200;
				break;

			case BaudMode::b2400:
				rate = 2400;
				break;

			case BaudMode::b4800:
				rate = 4800;
				break;

			case BaudMode::b9600:
				rate = 9600;
				break;

			case BaudMode::b19200:
				rate = 19200;
				break;

			case BaudMode::b38400:
				rate = 38400;
				break;

			case BaudMode::b57600:
				rate = 57600;
				break;

			case BaudMode::b115200:
				rate = 115200;
				break;

			default:
				break;
		}

		if (clockSource == ClockSource::automatic)
			clockSource = getClockSource(_usart);

		uint32_t fclk = getClockFrequency(_usart, clockSource);

		uint32_t div;
		if (baudMode == BaudMode::div)
			div = rate;
		else {
			if (overSampling == OverSampling::_8)
				div = (fclk + fclk + (rate / 2)) / rate;
			else
				div = (fclk + (rate / 2)) / rate;
		}

		if (overSampling == OverSampling::_8) {
			uint32_t temp = (uint16_t)(div & 0xFFF0U);
			temp |= (uint16_t)((div & (uint16_t)0x000FU) >> 1U);
			_usart->BRR = temp;
		}
		else
			_usart->BRR = div;

		return Results::success;
	}
	else
		return Results::errorState;
}


/// ----------------------------------------------------------------------
/// \brief    Transmiteix un bloc de dades.
/// \param    buffer: El bloc de dades.
/// \param    length: La longitut del bloc en bytes.
///
eos::Result UARTDevice::transmit(
	const uint8_t *buffer,
	unsigned length,
	unsigned timeout) {

	if (_state == State::ready) {

		auto expireTime = getTick() + timeout;
		bool error = false;

