Rafa350/EOS/v2/Source/HTL/STM32/htlUART.cpp
		// Interrupcio 'IDLE'
		//
		if ((CR1 & USART_CR1_IDLEIE) && (ISR & USART_ISR_IDLE)) {
			_usart->ICR = USART_ICR_IDLECF;
			if ((_state == State::receiving) && (_rxCount > 0)) {
				disableReception(_usart);
				notifyRxCompleted(_rxBuffer, _rxCount, true);
				_state = State::ready;
			}
		}

		// Interrupcio 'RTO'
		//
		if ((CR1 & USART_CR1_RTOIE) && (ISR & USART_ISR_RTOF)) {
			_usart->ICR = USART_ICR_RTOCF;
			disableReception(_usart);
			notifyRxCompleted(_rxBuffer, _rxCount, true);
			_state = State::ready;
		}
	}
}

#elif defined(EOS_PLATFORM_STM32F7)
void UARTDevice::interruptService() {

    // Interrupcio TXEFE (FIFO/TX empty)
    //
    if ((_usart->CR1 & USART_CR1_TXEIE) && (_usart->ISR & USART_ISR_TXE)) {

        if (_txCount < _txMaxCount) {
            _usart->TDR = _txBuffer[_txCount++];
            if (_txCount == _txMaxCount)
                ATOMIC_MODIFY_REG(_usart->CR1, USART_CR1_TXEIE, USART_CR1_TCIE);
        }
    }

    // Interrupcio TC (Transmission complete). Nomes en l'ultim caracter transmes
    //
    if ((_usart->CR1 & USART_CR1_TCIE) && (_usart->ISR & USART_ISR_TC)) {

        _usart->ICR |= USART_ICR_TCCF;
        ATOMIC_CLEAR_BIT(_usart->CR1, USART_CR1_TXEIE | USART_CR1_TCIE | USART_CR1_TE);
        notifyTxCompleted(_txBuffer, _txCount, true);
        _state = State::ready;
    }

    /// Interupcio FIFO/RD not empty
    //
    if ((_usart->CR1 & USART_CR1_RXNEIE) && (_usart->ISR & USART_ISR_RXNE)) {

        if (_rxCount < _rxNaxCount) {
            _rxBuffer[_rxCount++] = _usart->RDR;
            if (_rxCount == _rxMaxCount) {
                ATOMIC_CLEAR_BIT(_usart->CR1, USART_CR1_RXNEIE | USART_CR1_RTOIE | USART_CR1_RE);
                notifyRxComplete(_rxBuffer, _rxCount, true);
                _state = State::ready;
            }
        }
    }

    // Interrupcio RX timeout
    //
    if ((_usart->CR1 & USART_CR1_RTOIE) && (_usart->ISR & USART_ISR_RTOF)) {

        _usart->ICR |= USART_ICR_RTOCF;
        ATOMIC_CLEAR_BIT(_usart->CR1, USART_CR1_RXNEIE | USART_CR1_RTOIE | USART_CR1_RE);
        notifyRxCompleted(_rxBuffer, _rxCount, true);
        _state = State::ready;
    }
}

#elif defined(EOS_PLATFORM_STM32G0)
void UARTDevice::interruptService() {

	auto CR1 = _usart->CR1;
	auto CR3 = _usart->CR3;
	auto ISR = _usart->ISR;

	// Comprova de forma rapida si hi ha errors
	//
	if (ISR & (USART_ISR_PE | USART_ISR_FE | USART_ISR_ORE | USART_ISR_NE)) {

		// Comprova si es un error PARITY
		//
		if ((ISR & USART_ISR_PE) && (CR1 & USART_CR1_PEIE)) {
			_usart->ICR = USART_ICR_PECF;
		}

		// Comprova si hi ha error FRAME
		//
	    if ((ISR & USART_ISR_FE) && (CR3 & USART_CR3_EIE)) {
	    	_usart->ICR = USART_ICR_FECF;
	    }

	    // Comprova si es un error NOISE
	    //
	    if ((ISR & USART_ISR_NE) && (CR3 & USART_CR3_EIE)) {
	    	_usart->ICR = USART_ICR_NECF;
	    }

		// Comprova si es un error OVERRUN
		//
		if ((ISR & USART_ISR_ORE) &&
			(CR1 & USART_CR1_RXNEIE_RXFNEIE) &&
			(CR3 & (USART_CR3_RXFTIE | USART_CR3_EIE))) {
			_usart->ICR = USART_ICR_ORECF;
		}
	}

	// No hi han errrors
	//
	else {

		// Transmissio amb el FIFO activat
		//
		if (CR1 & USART_CR1_FIFOEN) {

		}

		// Transmissio amb el FIFO desactivat.
		///
		else {

			// Interrupcio 'TXE'
			//
			if ((CR1 & USART_CR1_TXEIE_TXFNFIE) && (ISR & USART_ISR_TXE_TXFNF)) {
				if (_txCount < _txMaxCount) {
					_usart->TDR = _txBuffer[_txCount++];
					if (_txCount == _txMaxCount) {

						ATOMIC_CLEAR_BIT(_usart->CR1,
							USART_CR1_TXEIE_TXFNFIE); // Deshabilita interrupcio TXE
						ATOMIC_SET_BIT(_usart->CR1,
							USART_CR1_TCIE);          // Habilita interrupcio TC
					}
				}
			}

			// Interrupcio 'TC'. Nomes en l'ultim caracter transmes.
			//
			if ((CR1 & USART_CR1_TCIE) && (ISR & USART_ISR_TC)) {
				_usart->ICR = USART_ICR_TCCF;
				disableTransmission(_usart);
				notifyTxCompleted(_txBuffer, _txCount, true);
				_state = State::ready;
			}

			/// Interrupcio 'RXNE'
			//
			if ((CR1 & USART_CR1_RXNEIE_RXFNEIE) && (ISR & USART_ISR_RXNE_RXFNE)) {
				if (_rxCount < _rxMaxCount) {
					_rxBuffer[_rxCount++] = _usart->RDR;
					if (_rxCount == _rxMaxCount) {

						disableReception(_usart);
						notifyRxCompleted(_rxBuffer, _rxCount, true);

						// Canvia l'estat
						//
						_state = State::ready;
					}
				}
			}

			// Interrupcio 'IDLE'
			//
			if ((CR1 & USART_CR1_IDLEIE) && (ISR & USART_ISR_IDLE)) {
				_usart->ICR = USART_ICR_IDLECF;
				if ((_state == State::receiving) && (_rxCount > 0)) {
					disableReception(_usart);
					notifyRxCompleted(_rxBuffer, _rxCount, true);
					_state = State::ready;
				}
			}

			// Interrupcio 'RTO'
			//
			if ((CR1 & USART_CR1_RTOIE) && (ISR & USART_ISR_RTOF)) {
				_usart->ICR = USART_ICR_RTOCF;
				disableReception(_usart);
				notifyRxCompleted(_rxBuffer, _rxCount, true);
				_state = State::ready;
			}
		}
	}
}
#endif


/// ----------------------------------------------------------------------
/// \brief    Reb les notificacions del DMA
/// \param    devDMA: El dispositiu DMA que genera l'event.
/// \param    args: Parametres del event.
///
void UARTDevice::dmaNotifyEventHandler(
    DevDMA *devDMA,
    DMANotifyEventArgs &args) {

    switch (args.id) {

        // Transmissio complerta de tots els bytes.
        //
        case htl::dma::NotifyID::completed:
            _txCount = _txMaxCount;
            _usart->ICR = USART_ICR_TCCF;
            ATOMIC_SET_BIT(_usart->CR1, USART_CR1_TCIE);
            devDMA->disableNotifyEvent();
            break;

        // Error en la transmissio DMA.
        //
        case htl::dma::NotifyID::error:
            break;

        default:
        	break;
    }
}


/// ----------------------------------------------------------------------
/// \brief    Genera un event de notificacio 'TxComplete'
/// \param    buffer: El buffer de dades.
/// \param    length: El nombre de bytes de dades.
/// \param    irq: true si ve d'una interrupcio.
///
void UARTDevice::notifyTxCompleted(
	const uint8_t *buffer,
	unsigned length,
	bool irq) {

	NotifyEventArgs args = {
		.irq = irq,
		.txCompleted {
			.buffer = buffer,
			.length = length
		}
	};
	_erNotify.raise(NotifyID::txCompleted, &args);
}


