Rafa350/EOS/v2/Source/HTL/STM32/htlUART.cpp
/// ----------------------------------------------------------------------
/// \brief    Configura la paritat.
/// \param    usart: Registres de hardware del dispositiu.
/// \param    parity: Opcions de paritat.
///
static void setParity(
    USART_TypeDef *usart,
    Parity parity) {

    auto tmp = usart->CR1;
    switch (parity) {
        case Parity::none:
            tmp &= ~USART_CR1_PCE;
            break;

        case Parity::even:
            tmp |= USART_CR1_PCE;
            tmp &= ~USART_CR1_PS;
            break;

        case Parity::odd:
            tmp |= USART_CR1_PCE;
            tmp |= USART_CR1_PS;
            break;
    }
    usart->CR1 = tmp;
}


/// ----------------------------------------------------------------------
/// \brief    Configura el nombre de bits de parada
/// \param    usart: Registres de harware del dispositiu.
/// \param    stopBits: Opcions dels bits de parada.
///
static void setStopBits(
    USART_TypeDef *usart,
    StopBits stopBits) {

    auto tmp = usart->CR2;
    switch (stopBits) {
        case StopBits::_0p5:
            tmp &= ~USART_CR2_STOP_1;
            tmp |= USART_CR2_STOP_0;
            break;

        case StopBits::_1:
            tmp &= ~USART_CR2_STOP_1;
            tmp &= ~USART_CR2_STOP_0;
            break;

        case StopBits::_1p5:
            tmp |= USART_CR2_STOP_1;
            tmp |= USART_CR2_STOP_0;
            break;

        case StopBits::_2:
            tmp |= USART_CR2_STOP_1;
            tmp &= ~USART_CR2_STOP_0;
            break;
    }
    usart->CR2 = tmp;
}


/// ----------------------------------------------------------------------
/// \brief    Configura nombre de bits de paraula.
/// \param    usart: Registres de herdware del dispositiu.
/// \param    wordBits: Opcions dels bits de paraula.
/// \params   useParity: True si utilitza bit de paritat
///
static void setWordBits(
    USART_TypeDef *usart,
    WordBits wordBits,
    bool useParity) {

    auto numBits = 7 + uint32_t(wordBits) + (useParity ? 0 : 1);

    auto tmp = usart->CR1;
    switch (numBits) {
        #if defined(EOS_PLATFORM_STM32F4) || defined(EOS_PLATFORM_STM32F7)
        case 7:
            tmp |= USART_CR1_M1;
            tmp &= ~USART_CR1_M0;
            break;
        #endif

        case 8:
            #if defined(EOS_PLATFORM_STM32F4) || defined(EOS_PLATFORM_STM32F7)
            tmp &= ~USART_CR1_M1;
            tmp &= ~USART_CR1_M0;
            #else
            tmp &= ~USART_CR1_M;
            #endif
            break;

        case 9:
            #if defined(EOS_PLATFORM_STM32F4) || defined(EOS_PLATFORM_STM32F7)
            tmp &= ~USART_CR1_M1;
            tmp |= USART_CR1_M0;
            #else
            tmp |= USART_CR1_M;
            #endif
            break;
    }
    usart->CR1 = tmp;
}


/// ----------------------------------------------------------------------
/// \brief    Configura el protocol.
/// \param    usart: Registres de hardware del dispositiu.
/// \param    handsake: Opcions de protocol.
///
static void setHandsake(
    USART_TypeDef *usart,
    Handsake handsake) {

    auto tmp = usart->CR3;
    switch (handsake) {
        case Handsake::none:
            tmp &= ~(USART_CR3_RTSE | USART_CR3_CTSE);
            break;

        case Handsake::ctsrts:
            tmp |= (USART_CR3_RTSE | USART_CR3_CTSE);
            break;
    }
    usart->CR3 = tmp;
}


/// ----------------------------------------------------------------------
/// \brief    Configura el timeout per recepcio.
/// \param    usart: Registres de hardware del dispositiu.
/// \param    timeout: Timeout en temps de bit individual.
///
static void setReceiveTimeout(
    USART_TypeDef *usart,
    unsigned timeout) {

    if (timeout == 0)
        usart->CR2 &= ~USART_CR2_RTOEN;
    else {
        usart->CR2 |= USART_CR2_RTOEN;
        usart->RTOR = timeout;
    }
}


/// ----------------------------------------------------------------------
/// \brief    Espera l'activacio del flag TC
/// \param    usart: Registres de hardware del dispositiu.
/// \param    timeout: El temps maxim d'espera en ticks.
/// \return   True si tot es correcte, false en cas de timeout.
///
static bool waitTransmissionCompleteFlag(
	USART_TypeDef *usart,
	unsigned expireTime) {

	while ((usart->ISR & USART_ISR_TC) == 0) {
		if (hasTickExpired(expireTime))
			return false;
	}

	usart->ICR = USART_ICR_TCCF;

	return true;
}


/// ----------------------------------------------------------------------
/// \brief    Espera l'activacio del flag TC
/// \param    usart: Registres de hardware del dispositiu.
/// \param    expireTime: El limit de temps.
/// \return   True si tot es correcte, false en cas de timeout.
///
static bool waitTransmissionBufferEmptyFlag(
	USART_TypeDef *usart,
	unsigned expireTime) {

#if defined(EOS_PLATFORM_STM32G0)
	while ((usart->ISR & USART_ISR_TXE_TXFNF) == 0) {
#else
	while ((usart->ISR & USART_ISR_TXE) == 0) {
#endif
		if (hasTickExpired(expireTime))
			return false;
	}

	return true;
}


/// ----------------------------------------------------------------------
/// \brief    Espera l'activacio de flag RXNE
/// \param    usart: Els registres de hardware del dispositiu.
/// \param    expireTime: El limit de temps.
/// \return   True si tot es correcte, false en cas de timeout.
///
static bool waitReceptionBufferNotEmptyFlag(
	USART_TypeDef *usart,
	unsigned expireTime) {

#if defined(EOS_PLATFORM_STM32G0)
	while ((usart->ISR & USART_ISR_RXNE_RXFNE) == 0) {
#else
	while ((usart->ISR & USART_ISR_RXNE) == 0) {
#endif
		if (hasTickExpired(expireTime))
			return false;
	}

	return true;
}


/// ----------------------------------------------------------------------
/// \brief    Habilita el dispositiu.
/// \param    usart: Registres de hardware del dispositiu.
///
static inline void enable(
	USART_TypeDef *usart) {

	usart->CR1 |= USART_CR1_UE;
}


/// ----------------------------------------------------------------------
/// \brief    Desabilita el dispositiu.
/// \param    usart: Registres de hardware del dispositiu.
///
static void disable(
	USART_TypeDef *usart) {

